bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1U.xml
                <instance name="ADCB">
                    <register-group address-space="data" offset="0x0240" name-in-module="ADC" name="ADCB"/>
                    <signals>
                        <signal function="ADCPOS" group="ADC" index="0" pad="PB0"/>
                        <signal function="ADCPOS" group="ADC" index="1" pad="PB1"/>
                        <signal function="ADCPOS" group="ADC" index="2" pad="PB2"/>
                        <signal function="ADCPOS" group="ADC" index="3" pad="PB3"/>
                        <signal function="ADCPOS" group="ADC" index="4" pad="PB4"/>
                        <signal function="ADCPOS" group="ADC" index="5" pad="PB5"/>
                        <signal function="ADCPOS" group="ADC" index="6" pad="PB6"/>
                        <signal function="ADCPOS" group="ADC" index="7" pad="PB7"/>
                        <signal function="GAINPOS" group="ADC" index="0" pad="PB0"/>
                        <signal function="GAINPOS" group="ADC" index="1" pad="PB1"/>
                        <signal function="GAINPOS" group="ADC" index="2" pad="PB2"/>
                        <signal function="GAINPOS" group="ADC" index="3" pad="PB3"/>
                        <signal function="GAINPOS" group="ADC" index="4" pad="PB4"/>
                        <signal function="GAINPOS" group="ADC" index="5" pad="PB5"/>
                        <signal function="GAINPOS" group="ADC" index="6" pad="PB6"/>
                        <signal function="GAINPOS" group="ADC" index="7" pad="PB7"/>
                        <signal function="ADCNEG" group="ADC" index="4" pad="PB4"/>
                        <signal function="ADCNEG" group="ADC" index="5" pad="PB5"/>
                        <signal function="ADCNEG" group="ADC" index="6" pad="PB6"/>
                        <signal function="ADCNEG" group="ADC" index="7" pad="PB7"/>
                        <signal function="GAINNEG" group="ADC" index="4" pad="PB4"/>
                        <signal function="GAINNEG" group="ADC" index="5" pad="PB5"/>
                        <signal function="GAINNEG" group="ADC" index="6" pad="PB6"/>
                        <signal function="GAINNEG" group="ADC" index="7" pad="PB7"/>
                        <signal function="AREF" group="REFA" index="0" pad="PA0"/>
                        <signal function="AREF" group="REFB" index="0" pad="PB0"/>
                    </signals>
                </instance>
            </module>
            <module name="DAC" id="I6059" version="XMEGAAU">
                <instance name="DACA">
                    <register-group address-space="data" offset="0x0300" name-in-module="DAC" name="DACA"/>
                    <signals>
                        <signal function="DAC" group="DAC" index="0" pad="PA2"/>
                        <signal function="DAC" group="DAC" index="1" pad="PA3"/>
                        <signal function="AREF" group="REFA" index="0" pad="PA0"/>
                        <signal function="AREF" group="REFB" index="0" pad="PB0"/>
                    </signals>
                </instance>
                <instance name="DACB">
                    <register-group address-space="data" offset="0x0320" name-in-module="DAC" name="DACB"/>
                    <signals>
                        <signal function="DAC" group="DAC" index="0" pad="PB2"/>
                        <signal function="DAC" group="DAC" index="1" pad="PB3"/>
                        <signal function="AREF" group="REFA" index="0" pad="PA0"/>
                        <signal function="AREF" group="REFB" index="0" pad="PB0"/>
                    </signals>
                </instance>
            </module>
            <module name="AC" id="I6077" version="XMEGAAU">
                <instance name="ACA">
                    <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
                    <signals>
                        <signal function="ACPOS" group="AC" index="0" pad="PA0"/>
                        <signal function="ACPOS" group="AC" index="1" pad="PA1"/>
                        <signal function="ACPOS" group="AC" index="2" pad="PA2"/>
                        <signal function="ACPOS" group="AC" index="3" pad="PA3"/>
                        <signal function="ACPOS" group="AC" index="4" pad="PA4"/>
                        <signal function="ACPOS" group="AC" index="5" pad="PA5"/>
                        <signal function="ACPOS" group="AC" index="6" pad="PA6"/>
                        <signal function="ACNEG" group="AC" index="0" pad="PA0"/>
                        <signal function="ACNEG" group="AC" index="1" pad="PA1"/>
                        <signal function="ACNEG" group="AC" index="3" pad="PA3"/>
                        <signal function="ACNEG" group="AC" index="5" pad="PA5"/>
                        <signal function="ACNEG" group="AC" index="7" pad="PA7"/>
                        <signal function="ACOUT" group="ACOUT" index="1" pad="PA6"/>
                        <signal function="ACOUT" group="ACOUT" index="0" pad="PA7"/>
                    </signals>
                </instance>
                <instance name="ACB">
                    <register-group address-space="data" offset="0x0390" name-in-module="AC" name="ACB"/>
                    <signals>
                        <signal function="ACPOS" group="AC" index="0" pad="PB0"/>
                        <signal function="ACPOS" group="AC" index="1" pad="PB1"/>
                        <signal function="ACPOS" group="AC" index="2" pad="PB2"/>
                        <signal function="ACPOS" group="AC" index="3" pad="PB3"/>
                        <signal function="ACPOS" group="AC" index="4" pad="PB4"/>
                        <signal function="ACPOS" group="AC" index="5" pad="PB5"/>
                        <signal function="ACPOS" group="AC" index="6" pad="PB6"/>
                        <signal function="ACNEG" group="AC" index="0" pad="PB0"/>
                        <signal function="ACNEG" group="AC" index="1" pad="PB1"/>
                        <signal function="ACNEG" group="AC" index="3" pad="PB3"/>
                        <signal function="ACNEG" group="AC" index="5" pad="PB5"/>
                        <signal function="ACNEG" group="AC" index="7" pad="PB7"/>
                        <signal function="ACOUT" group="ACOUT" index="1" pad="PB6"/>
                        <signal function="ACOUT" group="ACOUT" index="0" pad="PB7"/>
                    </signals>
                </instance>
            </module>
