bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1U.xml
            <module name="RTC" id="I6093">
                <instance name="RTC">
                    <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
                </instance>
            </module>
            <module name="EBI" id="I3001">
                <instance name="EBI">
                    <register-group address-space="data" offset="0x0440" name-in-module="EBI" name="EBI"/>
                    <signals>
                        <signal function="EBIPORT0" group="PORT0" index="0" pad="PH0"/>
                        <signal function="EBIPORT0" group="PORT0" index="1" pad="PH1"/>
                        <signal function="EBIPORT0" group="PORT0" index="2" pad="PH2"/>
                        <signal function="EBIPORT0" group="PORT0" index="3" pad="PH3"/>
                        <signal function="EBIPORT0" group="PORT0" index="4" pad="PH4"/>
                        <signal function="EBIPORT0" group="PORT0" index="5" pad="PH5"/>
                        <signal function="EBIPORT0" group="PORT0" index="6" pad="PH6"/>
                        <signal function="EBIPORT0" group="PORT0" index="7" pad="PH7"/>
                        <signal function="EBIPORT1" group="PORT1" index="0" pad="PJ0"/>
                        <signal function="EBIPORT1" group="PORT1" index="1" pad="PJ1"/>
                        <signal function="EBIPORT1" group="PORT1" index="2" pad="PJ2"/>
                        <signal function="EBIPORT1" group="PORT1" index="3" pad="PJ3"/>
                        <signal function="EBIPORT1" group="PORT1" index="4" pad="PJ4"/>
                        <signal function="EBIPORT1" group="PORT1" index="5" pad="PJ5"/>
                        <signal function="EBIPORT1" group="PORT1" index="6" pad="PJ6"/>
                        <signal function="EBIPORT1" group="PORT1" index="7" pad="PJ7"/>
                        <signal function="EBIPORT2" group="PORT2" index="0" pad="PK0"/>
                        <signal function="EBIPORT2" group="PORT2" index="1" pad="PK1"/>
                        <signal function="EBIPORT2" group="PORT2" index="2" pad="PK2"/>
                        <signal function="EBIPORT2" group="PORT2" index="3" pad="PK3"/>
                        <signal function="EBIPORT2" group="PORT2" index="4" pad="PK4"/>
                        <signal function="EBIPORT2" group="PORT2" index="5" pad="PK5"/>
                        <signal function="EBIPORT2" group="PORT2" index="6" pad="PK6"/>
                        <signal function="EBIPORT2" group="PORT2" index="7" pad="PK7"/>
                        <signal function="EBIPORT3" group="PORT3" index="0" pad="PF0"/>
                        <signal function="EBIPORT3" group="PORT3" index="1" pad="PF1"/>
                        <signal function="EBIPORT3" group="PORT3" index="2" pad="PF2"/>
                        <signal function="EBIPORT3" group="PORT3" index="3" pad="PF3"/>
                        <signal function="EBIPORT3" group="PORT3" index="4" pad="PF4"/>
                        <signal function="EBIPORT3" group="PORT3" index="5" pad="PF5"/>
                        <signal function="EBIPORT3" group="PORT3" index="6" pad="PF6"/>
                        <signal function="EBIPORT3" group="PORT3" index="7" pad="PF7"/>
                    </signals>
                </instance>
            </module>
            <module name="TWI" id="I6089">
                <instance name="TWIC">
                    <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
                    <signals>
                        <signal function="TWIC" group="SDA" pad="PC0"/>
                        <signal function="TWIC" group="SCL" pad="PC1"/>
                    </signals>
                </instance>
                <instance name="TWID">
                    <register-group address-space="data" offset="0x490" name-in-module="TWI" name="TWID"/>
                    <signals>
                        <signal function="TWID" group="SDA" pad="PD0"/>
                        <signal function="TWID" group="SCL" pad="PD1"/>
                    </signals>
                </instance>
                <instance name="TWIE">
                    <register-group address-space="data" offset="0x4A0" name-in-module="TWI" name="TWIE"/>
                    <signals>
                        <signal function="TWIE" group="SDA" pad="PE0"/>
                        <signal function="TWIE" group="SCL" pad="PE1"/>
                    </signals>
                </instance>
                <instance name="TWIF">
                    <register-group address-space="data" offset="0x4B0" name-in-module="TWI" name="TWIF"/>
                    <signals>
                        <signal function="TWIF" group="SDA" pad="PF0"/>
                        <signal function="TWIF" group="SCL" pad="PF1"/>
                    </signals>
                </instance>
            </module>
            <module name="USB" id="I3005" version="XMEGAAU">
                <instance name="USB">
                    <register-group address-space="data" offset="0x4C0" name-in-module="USB" name="USB"/>
                    <signals>
                        <signal function="USB" group="DN" pad="PD6"/>
                        <signal function="USB" group="DP" pad="PD7"/>
                    </signals>
                </instance>
            </module>
            <module name="PORT" id="I6075" version="XMEGAAU">
                <instance name="PORTA">
                    <register-group address-space="data" offset="0x0600" name-in-module="PORT" name="PORTA"/>
                    <signals>
                        <signal function="PORTA" group="P" index="0" pad="PA0"/>
                        <signal function="PORTA" group="P" index="1" pad="PA1"/>
                        <signal function="PORTA" group="P" index="2" pad="PA2"/>
                        <signal function="PORTA" group="P" index="3" pad="PA3"/>
                        <signal function="PORTA" group="P" index="4" pad="PA4"/>
                        <signal function="PORTA" group="P" index="5" pad="PA5"/>
                        <signal function="PORTA" group="P" index="6" pad="PA6"/>
                        <signal function="PORTA" group="P" index="7" pad="PA7"/>
                    </signals>
                </instance>
                <instance name="PORTB">
                    <register-group address-space="data" offset="0x0620" name-in-module="PORT" name="PORTB"/>
                    <signals>
                        <signal function="PORTB" group="P" index="0" pad="PB0"/>
                        <signal function="PORTB" group="P" index="1" pad="PB1"/>
                        <signal function="PORTB" group="P" index="2" pad="PB2"/>
                        <signal function="PORTB" group="P" index="3" pad="PB3"/>
                        <signal function="PORTB" group="P" index="4" pad="PB4"/>
                        <signal function="PORTB" group="P" index="5" pad="PB5"/>
                        <signal function="PORTB" group="P" index="6" pad="PB6"/>
                        <signal function="PORTB" group="P" index="7" pad="PB7"/>
                    </signals>
                </instance>
