bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1U.xml
            <value-group caption="Prescaler A Division Factor" name="CLK_PSADIV">
                <value caption="Divide by 1" name="1" value="0x00"/>
                <value caption="Divide by 2" name="2" value="0x01"/>
                <value caption="Divide by 4" name="4" value="0x03"/>
                <value caption="Divide by 8" name="8" value="0x05"/>
                <value caption="Divide by 16" name="16" value="0x07"/>
                <value caption="Divide by 32" name="32" value="0x09"/>
                <value caption="Divide by 64" name="64" value="0x0B"/>
                <value caption="Divide by 128" name="128" value="0x0D"/>
                <value caption="Divide by 256" name="256" value="0x0F"/>
                <value caption="Divide by 512" name="512" value="0x11"/>
            </value-group>
            <value-group caption="Prescaler B and C Division Factor" name="CLK_PSBCDIV">
                <value caption="Divide B by 1 and C by 1" name="1_1" value="0x00"/>
                <value caption="Divide B by 1 and C by 2" name="1_2" value="0x01"/>
                <value caption="Divide B by 4 and C by 1" name="4_1" value="0x02"/>
                <value caption="Divide B by 2 and C by 2" name="2_2" value="0x03"/>
            </value-group>
            <value-group caption="RTC Clock Source" name="CLK_RTCSRC">
                <value caption="1.024 kHz from internal 32kHz ULP" name="ULP" value="0x00"/>
                <value caption="1.024 kHz from 32.768 kHz crystal oscillator on TOSC" name="TOSC" value="0x01"/>
                <value caption="1.024 kHz from internal 32.768 kHz RC oscillator" name="RCOSC" value="0x02"/>
                <value caption="32.768 kHz from 32.768 kHz crystal oscillator on TOSC" name="TOSC32" value="0x05"/>
                <value caption="32.768 kHz from internal 32.768 kHz RC oscillator" name="RCOSC32" value="0x06"/>
                <value caption="External Clock from TOSC1" name="EXTCLK" value="0x07"/>
            </value-group>
            <value-group caption="USB Prescaler Division Factor" name="CLK_USBPSDIV">
                <value caption="Divide by 1" name="1" value="0x00"/>
                <value caption="Divide by 2" name="2" value="0x01"/>
                <value caption="Divide by 4" name="4" value="0x02"/>
                <value caption="Divide by 8" name="8" value="0x03"/>
                <value caption="Divide by 16" name="16" value="0x04"/>
                <value caption="Divide by 32" name="32" value="0x05"/>
            </value-group>
            <value-group caption="USB Clock Source" name="CLK_USBSRC">
                <value caption="PLL" name="PLL" value="0x00"/>
                <value caption="Internal 32 MHz RC Oscillator" name="RC32M" value="0x01"/>
            </value-group>
        </module>
        <module name="PR" id="I6073" version="XMEGAAU" caption="Power Reduction">
            <register-group caption="Power Reduction" name="PR" size="7">
                <register caption="General Power Reduction" name="PRGEN" offset="0x00" size="1">
                    <bitfield caption="USB" mask="0x40" name="USB"/>
                    <bitfield caption="AES" mask="0x10" name="AES"/>
                    <bitfield caption="External Bus Interface" mask="0x08" name="EBI"/>
                    <bitfield caption="Real-time Counter" mask="0x04" name="RTC"/>
                    <bitfield caption="Event System" mask="0x02" name="EVSYS"/>
                    <bitfield caption="DMA-Controller" mask="0x01" name="DMA"/>
                </register>
                <register caption="Power Reduction Port A" name="PRPA" offset="0x01" size="1">
                    <bitfield caption="Port A DAC" mask="0x04" name="DAC"/>
                    <bitfield caption="Port A ADC" mask="0x02" name="ADC"/>
                    <bitfield caption="Port A Analog Comparator" mask="0x01" name="AC"/>
                </register>
                <register caption="Power Reduction Port B" name="PRPB" offset="0x02" size="1">
                    <bitfield caption="Port B DAC" mask="0x04" name="DAC"/>
                    <bitfield caption="Port B ADC" mask="0x02" name="ADC"/>
                    <bitfield caption="Port B Analog Comparator" mask="0x01" name="AC"/>
                </register>
                <register caption="Power Reduction Port C" name="PRPC" offset="0x03" size="1">
                    <bitfield caption="Port C Two-wire Interface" mask="0x40" name="TWI"/>
                    <bitfield caption="Port C USART1" mask="0x20" name="USART1"/>
                    <bitfield caption="Port C USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port C SPI" mask="0x08" name="SPI"/>
                    <bitfield caption="Port C AWEX" mask="0x04" name="HIRES"/>
                    <bitfield caption="Port C Timer/Counter1" mask="0x02" name="TC1"/>
                    <bitfield caption="Port C Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
                <register caption="Power Reduction Port D" name="PRPD" offset="0x04" size="1">
                    <bitfield caption="Port D Two-wire Interface" mask="0x40" name="TWI"/>
                    <bitfield caption="Port D USART1" mask="0x20" name="USART1"/>
                    <bitfield caption="Port D USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port D SPI" mask="0x08" name="SPI"/>
                    <bitfield caption="Port D AWEX" mask="0x04" name="HIRES"/>
                    <bitfield caption="Port D Timer/Counter1" mask="0x02" name="TC1"/>
                    <bitfield caption="Port D Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
                <register caption="Power Reduction Port E" name="PRPE" offset="0x05" size="1">
                    <bitfield caption="Port E Two-wire Interface" mask="0x40" name="TWI"/>
                    <bitfield caption="Port E USART1" mask="0x20" name="USART1"/>
                    <bitfield caption="Port E USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port E SPI" mask="0x08" name="SPI"/>
                    <bitfield caption="Port E AWEX" mask="0x04" name="HIRES"/>
                    <bitfield caption="Port E Timer/Counter1" mask="0x02" name="TC1"/>
                    <bitfield caption="Port E Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
