bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1U.xml
                <register caption="Channel Repeat Count" name="REPCNT" offset="0x06" size="1"/>
                <register caption="Channel Source Address 0" name="SRCADDR0" offset="0x08" size="1"/>
                <register caption="Channel Source Address 1" name="SRCADDR1" offset="0x09" size="1"/>
                <register caption="Channel Source Address 2" name="SRCADDR2" offset="0x0A" size="1"/>
                <register caption="Channel Destination Address 0" name="DESTADDR0" offset="0x0C" size="1"/>
                <register caption="Channel Destination Address 1" name="DESTADDR1" offset="0x0D" size="1"/>
                <register caption="Channel Destination Address 2" name="DESTADDR2" offset="0x0E" size="1"/>
            </register-group>
            <register-group caption="DMA Controller" name="DMA" size="80">
                <register caption="Control" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Enable" mask="0x80" name="ENABLE"/>
                    <bitfield caption="Software Reset" mask="0x40" name="RESET"/>
                    <bitfield caption="Double Buffering Mode" mask="0x0C" name="DBUFMODE" values="DMA_DBUFMODE"/>
                    <bitfield caption="Channel Priority Mode" mask="0x03" name="PRIMODE" values="DMA_PRIMODE"/>
                </register>
                <register caption="Transfer Interrupt Status" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Channel 3 Block Transfer Error Interrupt Flag" mask="0x80" name="CH3ERRIF"/>
                    <bitfield caption="Channel 2 Block Transfer Error Interrupt Flag" mask="0x40" name="CH2ERRIF"/>
                    <bitfield caption="Channel 1 Block Transfer Error Interrupt Flag" mask="0x20" name="CH1ERRIF"/>
                    <bitfield caption="Channel 0 Block Transfer Error Interrupt Flag" mask="0x10" name="CH0ERRIF"/>
                    <bitfield caption="Channel 3 Transaction Complete Interrupt Flag" mask="0x08" name="CH3TRNIF"/>
                    <bitfield caption="Channel 2 Transaction Complete Interrupt Flag" mask="0x04" name="CH2TRNIF"/>
                    <bitfield caption="Channel 1 Transaction Complete Interrupt Flag" mask="0x02" name="CH1TRNIF"/>
                    <bitfield caption="Channel 0 Transaction Complete Interrupt Flag" mask="0x01" name="CH0TRNIF"/>
                </register>
                <register caption="Status" name="STATUS" offset="0x04" size="1">
                    <bitfield caption="Channel 3 Block Transfer Busy" mask="0x80" name="CH3BUSY"/>
                    <bitfield caption="Channel 2 Block Transfer Busy" mask="0x40" name="CH2BUSY"/>
                    <bitfield caption="Channel 1 Block Transfer Busy" mask="0x20" name="CH1BUSY"/>
                    <bitfield caption="Channel 0 Block Transfer Busy" mask="0x10" name="CH0BUSY"/>
                    <bitfield caption="Channel 3 Block Transfer Pending" mask="0x08" name="CH3PEND"/>
                    <bitfield caption="Channel 2 Block Transfer Pending" mask="0x04" name="CH2PEND"/>
                    <bitfield caption="Channel 1 Block Transfer Pending" mask="0x02" name="CH1PEND"/>
                    <bitfield caption="Channel 0 Block Transfer Pending" mask="0x01" name="CH0PEND"/>
                </register>
                <register caption="Temporary Register For 16/24-bit Access" name="TEMP" offset="0x06" size="2"/>
                <register-group caption="DMA Channel 0" name="CH0" offset="0x10" name-in-module="DMA_CH"/>
                <register-group caption="DMA Channel 1" name="CH1" offset="0x20" name-in-module="DMA_CH"/>
                <register-group caption="DMA Channel 2" name="CH2" offset="0x30" name-in-module="DMA_CH"/>
                <register-group caption="DMA Channel 3" name="CH3" offset="0x40" name-in-module="DMA_CH"/>
            </register-group>
            <value-group caption="Burst mode" name="DMA_CH_BURSTLEN">
                <value caption="1-byte burst mode" name="1BYTE" value="0x00"/>
                <value caption="2-byte burst mode" name="2BYTE" value="0x01"/>
                <value caption="4-byte burst mode" name="4BYTE" value="0x02"/>
                <value caption="8-byte burst mode" name="8BYTE" value="0x03"/>
            </value-group>
            <value-group caption="Source address reload mode" name="DMA_CH_SRCRELOAD">
                <value caption="No reload" name="NONE" value="0x00"/>
                <value caption="Reload at end of block" name="BLOCK" value="0x01"/>
                <value caption="Reload at end of burst" name="BURST" value="0x02"/>
                <value caption="Reload at end of transaction" name="TRANSACTION" value="0x03"/>
            </value-group>
            <value-group caption="Source addressing mode" name="DMA_CH_SRCDIR">
                <value caption="Fixed" name="FIXED" value="0x00"/>
                <value caption="Increment" name="INC" value="0x01"/>
                <value caption="Decrement" name="DEC" value="0x02"/>
            </value-group>
            <value-group caption="Destination address reload mode" name="DMA_CH_DESTRELOAD">
                <value caption="No reload" name="NONE" value="0x00"/>
                <value caption="Reload at end of block" name="BLOCK" value="0x01"/>
                <value caption="Reload at end of burst" name="BURST" value="0x02"/>
                <value caption="Reload at end of transaction" name="TRANSACTION" value="0x03"/>
            </value-group>
            <value-group caption="Destination addressing mode" name="DMA_CH_DESTDIR">
                <value caption="Fixed" name="FIXED" value="0x00"/>
                <value caption="Increment" name="INC" value="0x01"/>
                <value caption="Decrement" name="DEC" value="0x02"/>
            </value-group>
            <value-group caption="Transfer trigger source" name="DMA_CH_TRIGSRC">
                <value caption="Off software triggers only" name="OFF" value="0x00"/>
                <value caption="Event System Channel 0" name="EVSYS_CH0" value="0x01"/>
                <value caption="Event System Channel 1" name="EVSYS_CH1" value="0x02"/>
                <value caption="Event System Channel 2" name="EVSYS_CH2" value="0x03"/>
                <value caption="AES" name="AES" value="0x04"/>
                <value caption="ADCA Channel 0" name="ADCA_CH0" value="0x10"/>
                <value caption="ADCA Channel 1" name="ADCA_CH1" value="0x11"/>
                <value caption="ADCA Channel 2" name="ADCA_CH2" value="0x12"/>
                <value caption="ADCA Channel 3" name="ADCA_CH3" value="0x13"/>
                <value caption="ADCA Channel 0,1,2,3 combined" name="ADCA_CH4" value="0x14"/>
                <value caption="DACA Channel 0" name="DACA_CH0" value="0x15"/>
                <value caption="DACA Channel 1" name="DACA_CH1" value="0x16"/>
                <value caption="ADCB Channel 0" name="ADCB_CH0" value="0x20"/>
                <value caption="ADCB Channel 1" name="ADCB_CH1" value="0x21"/>
                <value caption="ADCB Channel 2" name="ADCB_CH2" value="0x22"/>
                <value caption="ADCB Channel 3" name="ADCB_CH3" value="0x23"/>
                <value caption="ADCB Channel 0,1,2,3 combined" name="ADCB_CH4" value="0x24"/>
                <value caption="DACB Channel 0" name="DACB_CH0" value="0x25"/>
                <value caption="DACB Channel 1" name="DACB_CH1" value="0x26"/>
                <value caption="Timer/Counter C0 Overflow" name="TCC0_OVF" value="0x40"/>
                <value caption="Timer/Counter C0 Error" name="TCC0_ERR" value="0x41"/>
                <value caption="Timer/Counter C0 Compare or Capture A" name="TCC0_CCA" value="0x42"/>
                <value caption="Timer/Counter C0 Compare or Capture B" name="TCC0_CCB" value="0x43"/>
                <value caption="Timer/Counter C0 Compare or Capture C" name="TCC0_CCC" value="0x44"/>
                <value caption="Timer/Counter C0 Compare or Capture D" name="TCC0_CCD" value="0x45"/>
                <value caption="Timer/Counter C1 Overflow" name="TCC1_OVF" value="0x46"/>
                <value caption="Timer/Counter C1 Error" name="TCC1_ERR" value="0x47"/>
                <value caption="Timer/Counter C1 Compare or Capture A" name="TCC1_CCA" value="0x48"/>
                <value caption="Timer/Counter C1 Compare or Capture B" name="TCC1_CCB" value="0x49"/>
                <value caption="SPI C Transfer Complete" name="SPIC" value="0x4A"/>
                <value caption="USART C0 Receive Complete" name="USARTC0_RXC" value="0x4B"/>
                <value caption="USART C0 Data Register Empty" name="USARTC0_DRE" value="0x4C"/>
                <value caption="USART C1 Receive Complete" name="USARTC1_RXC" value="0x4E"/>
                <value caption="USART C1 Data Register Empty" name="USARTC1_DRE" value="0x4F"/>
                <value caption="Timer/Counter D0 Overflow" name="TCD0_OVF" value="0x60"/>
                <value caption="Timer/Counter D0 Error" name="TCD0_ERR" value="0x61"/>
                <value caption="Timer/Counter D0 Compare or Capture A" name="TCD0_CCA" value="0x62"/>
                <value caption="Timer/Counter D0 Compare or Capture B" name="TCD0_CCB" value="0x63"/>
                <value caption="Timer/Counter D0 Compare or Capture C" name="TCD0_CCC" value="0x64"/>
                <value caption="Timer/Counter D0 Compare or Capture D" name="TCD0_CCD" value="0x65"/>
                <value caption="Timer/Counter D1 Overflow" name="TCD1_OVF" value="0x66"/>
                <value caption="Timer/Counter D1 Error" name="TCD1_ERR" value="0x67"/>
                <value caption="Timer/Counter D1 Compare or Capture A" name="TCD1_CCA" value="0x68"/>
                <value caption="Timer/Counter D1 Compare or Capture B" name="TCD1_CCB" value="0x69"/>
                <value caption="SPI D Transfer Complete" name="SPID" value="0x6A"/>
                <value caption="USART D0 Receive Complete" name="USARTD0_RXC" value="0x6B"/>
                <value caption="USART D0 Data Register Empty" name="USARTD0_DRE" value="0x6C"/>
                <value caption="USART D1 Receive Complete" name="USARTD1_RXC" value="0x6E"/>
                <value caption="USART D1 Data Register Empty" name="USARTD1_DRE" value="0x6F"/>
                <value caption="Timer/Counter E0 Overflow" name="TCE0_OVF" value="0x80"/>
                <value caption="Timer/Counter E0 Error" name="TCE0_ERR" value="0x81"/>
                <value caption="Timer/Counter E0 Compare or Capture A" name="TCE0_CCA" value="0x82"/>
                <value caption="Timer/Counter E0 Compare or Capture B" name="TCE0_CCB" value="0x83"/>
                <value caption="Timer/Counter E0 Compare or Capture C" name="TCE0_CCC" value="0x84"/>
                <value caption="Timer/Counter E0 Compare or Capture D" name="TCE0_CCD" value="0x85"/>
                <value caption="Timer/Counter E1 Overflow" name="TCE1_OVF" value="0x86"/>
                <value caption="Timer/Counter E1 Error" name="TCE1_ERR" value="0x87"/>
                <value caption="Timer/Counter E1 Compare or Capture A" name="TCE1_CCA" value="0x88"/>
                <value caption="Timer/Counter E1 Compare or Capture B" name="TCE1_CCB" value="0x89"/>
                <value caption="SPI E Transfer Complete" name="SPIE" value="0x8A"/>
                <value caption="USART E0 Receive Complete" name="USARTE0_RXC" value="0x8B"/>
                <value caption="USART E0 Data Register Empty" name="USARTE0_DRE" value="0x8C"/>
                <value caption="USART E1 Receive Complete" name="USARTE1_RXC" value="0x8E"/>
                <value caption="USART E1 Data Register Empty" name="USARTE1_DRE" value="0x8F"/>
                <value caption="Timer/Counter F0 Overflow" name="TCF0_OVF" value="0xA0"/>
                <value caption="Timer/Counter F0 Error" name="TCF0_ERR" value="0xA1"/>
                <value caption="Timer/Counter F0 Compare or Capture A" name="TCF0_CCA" value="0xA2"/>
                <value caption="Timer/Counter F0 Compare or Capture B" name="TCF0_CCB" value="0xA3"/>
                <value caption="Timer/Counter F0 Compare or Capture C" name="TCF0_CCC" value="0xA4"/>
                <value caption="Timer/Counter F0 Compare or Capture D" name="TCF0_CCD" value="0xA5"/>
                <value caption="Timer/Counter F1 Overflow" name="TCF1_OVF" value="0xA6"/>
                <value caption="Timer/Counter F1 Error" name="TCF1_ERR" value="0xA7"/>
                <value caption="Timer/Counter F1 Compare or Capture A" name="TCF1_CCA" value="0xA8"/>
                <value caption="Timer/Counter F1 Compare or Capture B" name="TCF1_CCB" value="0xA9"/>
                <value caption="SPI F Transfer Complete" name="SPIF" value="0xAA"/>
                <value caption="USART F0 Receive Complete" name="USARTF0_RXC" value="0xAB"/>
                <value caption="USART F0 Data Register Empty" name="USARTF0_DRE" value="0xAC"/>
                <value caption="USART F1 Receive Complete" name="USARTF1_RXC" value="0xAE"/>
                <value caption="USART F1 Data Register Empty" name="USARTF1_DRE" value="0xAF"/>
            </value-group>
