bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1U.xml
        <module name="RTC" id="I6093" caption="Real-Time Counter">
            <register-group caption="Real-Time Counter" name="RTC" size="14">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Prescaling Factor" mask="0x07" name="PRESCALER" values="RTC_PRESCALER"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Synchronization Busy Flag" mask="0x01" name="SYNCBUSY"/>
                </register>
                <register caption="Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
                    <bitfield caption="Compare Match Interrupt Level" mask="0x0C" name="COMPINTLVL" values="RTC_COMPINTLVL"/>
                    <bitfield caption="Overflow Interrupt Level" mask="0x03" name="OVFINTLVL" values="RTC_OVFINTLVL"/>
                </register>
                <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Compare Match Interrupt Flag" mask="0x02" name="COMPIF"/>
                    <bitfield caption="Overflow Interrupt Flag" mask="0x01" name="OVFIF"/>
                </register>
                <register caption="Temporary register" name="TEMP" offset="0x04" size="1"/>
                <register caption="Count Register" name="CNT" offset="0x08" size="2"/>
                <register caption="Period Register" name="PER" offset="0x0A" size="2"/>
                <register caption="Compare Register" name="COMP" offset="0x0C" size="2"/>
            </register-group>
            <value-group caption="Prescaler Factor" name="RTC_PRESCALER">
                <value caption="RTC Off" name="OFF" value="0x00"/>
                <value caption="RTC Clock" name="DIV1" value="0x01"/>
                <value caption="RTC Clock / 2" name="DIV2" value="0x02"/>
                <value caption="RTC Clock / 8" name="DIV8" value="0x03"/>
                <value caption="RTC Clock / 16" name="DIV16" value="0x04"/>
                <value caption="RTC Clock / 64" name="DIV64" value="0x05"/>
                <value caption="RTC Clock / 256" name="DIV256" value="0x06"/>
                <value caption="RTC Clock / 1024" name="DIV1024" value="0x07"/>
            </value-group>
            <value-group caption="Compare Interrupt level" name="RTC_COMPINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Overflow Interrupt level" name="RTC_OVFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="RTC">
                <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
                <interrupt index="1" name="COMP" caption="Compare Interrupt"/>
            </interrupt-group>
        </module>
        <module name="EBI" id="I3001" caption="External Bus Interface">
            <register-group caption="EBI Chip Select Module" name="EBI_CS" size="4">
                <register caption="Chip Select Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Address Size" mask="0x7C" name="ASIZE" values="EBI_CS_ASIZE"/>
                    <bitfield caption="Legacy name: Address Space" mask="0x7C" name="ASPACE" values="EBI_CS_ASPACE"/>
                    <bitfield caption="Memory Mode" mask="0x03" name="MODE" values="EBI_CS_MODE"/>
                </register>
                <register caption="Chip Select Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="SRAM Wait State Cycles" mask="0x07" name="SRWS" values="EBI_CS_SRWS"/>
                    <bitfield caption="SDRAM Initialization Done" mask="0x80" name="SDINITDONE"/>
                    <bitfield caption="SDRAM Self-refresh Enable" mask="0x04" name="SDSREN"/>
                    <bitfield caption="SDRAM Mode" mask="0x03" name="SDMODE" values="EBI_CS_SDMODE"/>
                </register>
                <register caption="Base Address" name="BASEADDR" offset="0x02" size="2">
                    <bitfield caption="Chip Select Base Address" mask="0xFFF0" name="BASEADDR"/>
                </register>
            </register-group>
            <register-group caption="External Bus Interface" name="EBI" size="32">
                <register caption="Control" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="SDRAM Data Width Setting" mask="0xC0" name="SDDATAW" values="EBI_SDDATAW"/>
                    <bitfield caption="SRAM LPC Mode" mask="0x30" name="LPCMODE" values="EBI_LPCMODE"/>
                    <bitfield caption="SRAM Mode" mask="0x0C" name="SRMODE" values="EBI_SRMODE"/>
                    <bitfield caption="Interface Mode" mask="0x03" name="IFMODE" values="EBI_IFMODE"/>
                </register>
                <register caption="SDRAM Control Register A" name="SDRAMCTRLA" offset="0x01" size="1">
                    <bitfield caption="SDRAM CAS Latency Setting" mask="0x08" name="SDCAS"/>
                    <bitfield caption="SDRAM ROW Bits Setting" mask="0x04" name="SDROW"/>
                    <bitfield caption="SDRAM Column Bits Setting" mask="0x03" name="SDCOL" values="EBI_SDCOL"/>
                </register>
                <register caption="SDRAM Refresh Period" name="REFRESH" offset="0x04" size="2"/>
                <register caption="SDRAM Initialization Delay" name="INITDLY" offset="0x06" size="2"/>
                <register caption="SDRAM Control Register B" name="SDRAMCTRLB" offset="0x08" size="1">
                    <bitfield caption="SDRAM Mode Register Delay" mask="0xC0" name="MRDLY" values="EBI_MRDLY"/>
                    <bitfield caption="SDRAM Row Cycle Delay" mask="0x38" name="ROWCYCDLY" values="EBI_ROWCYCDLY"/>
                    <bitfield caption="SDRAM Row-to-Precharge Delay" mask="0x07" name="RPDLY" values="EBI_RPDLY"/>
                </register>
