bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128A1U.xml
            <value-group caption="SDRAM Load Mode to Active delay" name="EBI_MRDLY">
                <value caption="0 cycles" name="0CLK" value="0x00"/>
                <value caption="1 cycle" name="1CLK" value="0x01"/>
                <value caption="2 cycles" name="2CLK" value="0x02"/>
                <value caption="3 cycles" name="3CLK" value="0x03"/>
            </value-group>
            <value-group caption="SDRAM Row Cycle Delay" name="EBI_ROWCYCDLY">
                <value caption="0 cycles" name="0CLK" value="0x00"/>
                <value caption="1 cycle" name="1CLK" value="0x01"/>
                <value caption="2 cycles" name="2CLK" value="0x02"/>
                <value caption="3 cycles" name="3CLK" value="0x03"/>
                <value caption="4 cycles" name="4CLK" value="0x04"/>
                <value caption="5 cycles" name="5CLK" value="0x05"/>
                <value caption="6 cycles" name="6CLK" value="0x06"/>
                <value caption="7 cycles" name="7CLK" value="0x07"/>
            </value-group>
            <value-group caption="SDRAM Row to Precharge Delay" name="EBI_RPDLY">
                <value caption="0 cycles" name="0CLK" value="0x00"/>
                <value caption="1 cycle" name="1CLK" value="0x01"/>
                <value caption="2 cycles" name="2CLK" value="0x02"/>
                <value caption="3 cycles" name="3CLK" value="0x03"/>
                <value caption="4 cycles" name="4CLK" value="0x04"/>
                <value caption="5 cycles" name="5CLK" value="0x05"/>
                <value caption="6 cycles" name="6CLK" value="0x06"/>
                <value caption="7 cycles" name="7CLK" value="0x07"/>
            </value-group>
            <value-group caption="SDRAM Write Recovery Delay" name="EBI_WRDLY">
                <value caption="0 cycles" name="0CLK" value="0x00"/>
                <value caption="1 cycle" name="1CLK" value="0x01"/>
                <value caption="2 cycles" name="2CLK" value="0x02"/>
                <value caption="3 cycles" name="3CLK" value="0x03"/>
            </value-group>
            <value-group caption="SDRAM Exit Self Refresh to Active Delay" name="EBI_ESRDLY">
                <value caption="0 cycles" name="0CLK" value="0x00"/>
                <value caption="1 cycle" name="1CLK" value="0x01"/>
                <value caption="2 cycles" name="2CLK" value="0x02"/>
                <value caption="3 cycles" name="3CLK" value="0x03"/>
                <value caption="4 cycles" name="4CLK" value="0x04"/>
                <value caption="5 cycles" name="5CLK" value="0x05"/>
                <value caption="6 cycles" name="6CLK" value="0x06"/>
                <value caption="7 cycles" name="7CLK" value="0x07"/>
            </value-group>
            <value-group caption="SDRAM Row to Column Delay" name="EBI_ROWCOLDLY">
                <value caption="0 cycles" name="0CLK" value="0x00"/>
                <value caption="1 cycle" name="1CLK" value="0x01"/>
                <value caption="2 cycles" name="2CLK" value="0x02"/>
                <value caption="3 cycles" name="3CLK" value="0x03"/>
                <value caption="4 cycles" name="4CLK" value="0x04"/>
                <value caption="5 cycles" name="5CLK" value="0x05"/>
                <value caption="6 cycles" name="6CLK" value="0x06"/>
                <value caption="7 cycles" name="7CLK" value="0x07"/>
            </value-group>
        </module>
        <module name="TWI" id="I6089" caption="Two-Wire Interface">
            <register-group caption="" name="TWI_MASTER" size="7">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Interrupt Level" mask="0xC0" name="INTLVL" values="TWI_MASTER_INTLVL"/>
                    <bitfield caption="Read Interrupt Enable" mask="0x20" name="RIEN"/>
                    <bitfield caption="Write Interrupt Enable" mask="0x10" name="WIEN"/>
                    <bitfield caption="Enable TWI Master" mask="0x08" name="ENABLE"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Inactive Bus timeout" mask="0x0C" name="TIMEOUT" values="TWI_MASTER_TIMEOUT"/>
                    <bitfield caption="Quick Command Enable" mask="0x02" name="QCEN"/>
                    <bitfield caption="Smart Mode Enable" mask="0x01" name="SMEN"/>
                </register>
                <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
                    <bitfield caption="Acknowledge Action" mask="0x04" name="ACKACT"/>
                    <bitfield caption="Command" mask="0x03" name="CMD" values="TWI_MASTER_CMD"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x03" size="1">
                    <bitfield caption="Read Interrupt Flag" mask="0x80" name="RIF"/>
                    <bitfield caption="Write Interrupt Flag" mask="0x40" name="WIF"/>
                    <bitfield caption="Clock Hold" mask="0x20" name="CLKHOLD"/>
                    <bitfield caption="Received Acknowledge" mask="0x10" name="RXACK"/>
                    <bitfield caption="Arbitration Lost" mask="0x08" name="ARBLOST"/>
                    <bitfield caption="Bus Error" mask="0x04" name="BUSERR"/>
                    <bitfield caption="Bus State" mask="0x03" name="BUSSTATE" values="TWI_MASTER_BUSSTATE"/>
                </register>
                <register caption="Baud Rate Control Register" name="BAUD" offset="0x04" size="1"/>
                <register caption="Address Register" name="ADDR" offset="0x05" size="1"/>
                <register caption="Data Register" name="DATA" offset="0x06" size="1"/>
            </register-group>
            <register-group caption="" name="TWI_SLAVE" size="6">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Interrupt Level" mask="0xC0" name="INTLVL" values="TWI_SLAVE_INTLVL"/>
                    <bitfield caption="Data Interrupt Enable" mask="0x20" name="DIEN"/>
                    <bitfield caption="Address/Stop Interrupt Enable" mask="0x10" name="APIEN"/>
                    <bitfield caption="Enable TWI Slave" mask="0x08" name="ENABLE"/>
                    <bitfield caption="Stop Interrupt Enable" mask="0x04" name="PIEN"/>
                    <bitfield caption="Promiscuous Mode Enable" mask="0x02" name="PMEN"/>
                    <bitfield caption="Smart Mode Enable" mask="0x01" name="SMEN"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Acknowledge Action" mask="0x04" name="ACKACT"/>
                    <bitfield caption="Command" mask="0x03" name="CMD" values="TWI_SLAVE_CMD"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x02" size="1">
                    <bitfield caption="Data Interrupt Flag" mask="0x80" name="DIF"/>
                    <bitfield caption="Address/Stop Interrupt Flag" mask="0x40" name="APIF"/>
                    <bitfield caption="Clock Hold" mask="0x20" name="CLKHOLD"/>
                    <bitfield caption="Received Acknowledge" mask="0x10" name="RXACK"/>
                    <bitfield caption="Collision" mask="0x08" name="COLL"/>
                    <bitfield caption="Bus Error" mask="0x04" name="BUSERR"/>
                    <bitfield caption="Read/Write Direction" mask="0x02" name="DIR"/>
                    <bitfield caption="Slave Address or Stop" mask="0x01" name="AP"/>
                </register>
                <register caption="Address Register" name="ADDR" offset="0x03" size="1"/>
                <register caption="Data Register" name="DATA" offset="0x04" size="1"/>
